betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_mmc.h
/** @defgroup MMC_Exported_Functions_Group2 Input and Output operation functions
  * @{
  */
/* Blocking mode: Polling */
DAL_StatusTypeDef DAL_MMC_ReadBlocks(MMC_HandleTypeDef *hmmc, uint8_t *pData, uint32_t BlockAdd, uint32_t NumberOfBlocks, uint32_t Timeout);
DAL_StatusTypeDef DAL_MMC_WriteBlocks(MMC_HandleTypeDef *hmmc, uint8_t *pData, uint32_t BlockAdd, uint32_t NumberOfBlocks, uint32_t Timeout);
DAL_StatusTypeDef DAL_MMC_Erase(MMC_HandleTypeDef *hmmc, uint32_t BlockStartAdd, uint32_t BlockEndAdd);
/* Non-Blocking mode: IT */
DAL_StatusTypeDef DAL_MMC_ReadBlocks_IT(MMC_HandleTypeDef *hmmc, uint8_t *pData, uint32_t BlockAdd, uint32_t NumberOfBlocks);
DAL_StatusTypeDef DAL_MMC_WriteBlocks_IT(MMC_HandleTypeDef *hmmc, uint8_t *pData, uint32_t BlockAdd, uint32_t NumberOfBlocks);
/* Non-Blocking mode: DMA */
DAL_StatusTypeDef DAL_MMC_ReadBlocks_DMA(MMC_HandleTypeDef *hmmc, uint8_t *pData, uint32_t BlockAdd, uint32_t NumberOfBlocks);
DAL_StatusTypeDef DAL_MMC_WriteBlocks_DMA(MMC_HandleTypeDef *hmmc, uint8_t *pData, uint32_t BlockAdd, uint32_t NumberOfBlocks);

void DAL_MMC_IRQHandler(MMC_HandleTypeDef *hmmc);

/* Callback in non blocking modes (DMA) */
void DAL_MMC_TxCpltCallback(MMC_HandleTypeDef *hmmc);
void DAL_MMC_RxCpltCallback(MMC_HandleTypeDef *hmmc);
void DAL_MMC_ErrorCallback(MMC_HandleTypeDef *hmmc);
void DAL_MMC_AbortCallback(MMC_HandleTypeDef *hmmc);

#if defined (USE_DAL_MMC_REGISTER_CALLBACKS) && (USE_DAL_MMC_REGISTER_CALLBACKS == 1U)
/* MMC callback registering/unregistering */
DAL_StatusTypeDef DAL_MMC_RegisterCallback  (MMC_HandleTypeDef *hmmc, DAL_MMC_CallbackIDTypeDef CallbackId, pMMC_CallbackTypeDef pCallback);
DAL_StatusTypeDef DAL_MMC_UnRegisterCallback(MMC_HandleTypeDef *hmmc, DAL_MMC_CallbackIDTypeDef CallbackId);
#endif
/**
  * @}
  */
  
/** @defgroup MMC_Exported_Functions_Group3 Peripheral Control functions
  * @{
  */
DAL_StatusTypeDef DAL_MMC_ConfigWideBusOperation(MMC_HandleTypeDef *hmmc, uint32_t WideMode);
/**
  * @}
  */

/** @defgroup MMC_Exported_Functions_Group4 MMC card related functions
  * @{
  */
DAL_MMC_CardStateTypeDef DAL_MMC_GetCardState(MMC_HandleTypeDef *hmmc);
DAL_StatusTypeDef DAL_MMC_GetCardCID(MMC_HandleTypeDef *hmmc, DAL_MMC_CardCIDTypeDef *pCID);
DAL_StatusTypeDef DAL_MMC_GetCardCSD(MMC_HandleTypeDef *hmmc, DAL_MMC_CardCSDTypeDef *pCSD);
DAL_StatusTypeDef DAL_MMC_GetCardInfo(MMC_HandleTypeDef *hmmc, DAL_MMC_CardInfoTypeDef *pCardInfo);
DAL_StatusTypeDef DAL_MMC_GetCardExtCSD(MMC_HandleTypeDef *hmmc, uint32_t *pExtCSD, uint32_t Timeout);
/**
  * @}
  */

/** @defgroup MMC_Exported_Functions_Group5 Peripheral State and Errors functions
  * @{
  */
DAL_MMC_StateTypeDef DAL_MMC_GetState(MMC_HandleTypeDef *hmmc);
uint32_t DAL_MMC_GetError(MMC_HandleTypeDef *hmmc);
/**
  * @}
  */

/** @defgroup MMC_Exported_Functions_Group6 Peripheral Abort management
  * @{
  */
DAL_StatusTypeDef DAL_MMC_Abort(MMC_HandleTypeDef *hmmc);
DAL_StatusTypeDef DAL_MMC_Abort_IT(MMC_HandleTypeDef *hmmc);
/**
  * @}
  */
    
/* Private types -------------------------------------------------------------*/
/** @defgroup MMC_Private_Types MMC Private Types
  * @{
  */

/**
  * @}
  */ 

/* Private defines -----------------------------------------------------------*/
/** @defgroup MMC_Private_Defines MMC Private Defines
  * @{
  */

/**
  * @}
  */ 
          
/* Private variables ---------------------------------------------------------*/
/** @defgroup MMC_Private_Variables MMC Private Variables
  * @{
  */

/**
  * @}
  */ 

/* Private constants ---------------------------------------------------------*/
/** @defgroup MMC_Private_Constants MMC Private Constants
  * @{
  */

/**
  * @}
  */ 

/* Private macros ------------------------------------------------------------*/
/** @defgroup MMC_Private_Macros MMC Private Macros
  * @{
  */

/**
  * @}
  */

/* Private functions prototypes ----------------------------------------------*/
/** @defgroup MMC_Private_Functions_Prototypes MMC Private Functions Prototypes
  * @{
  */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @defgroup MMC_Private_Functions MMC Private Functions
  * @{
  */

/**
  * @}
  */


/**
  * @}
  */ 

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* SDIO */

#endif /* APM32F4xx_DAL_MMC_H */ 
